<?php
    $posts = [
        [
            'id' => 1,
            'title' => 'Цитата',
            'type' => 'quote',
            'content' => 'Мы в жизни любим только раз, а после ищем лишь похожих',
            'author' => 'Лариса',
            'avatar' => 'userpic-larisa-small.jpg'
        ],
        [
            'id' => 2,
            'title' => 'Игра престолов',
            'type' => 'text',
            'content' => 'Не могу дождаться начала финального сезона своего любимого сериала!',
            'author' => 'Владик',
            'avatar' => 'userpic.jpg'
        ],
        [
            'id' => 3,
            'title' => 'Пишем первую функцию',
            'type' => 'text',
            'content' => 'Чтобы карточки оставались компактными и не занимали слишком много места размер содержимого надо принудительно ограничивать. Для фотографий и видео это можно сделать через CSS, для цитат и ссылок есть ограничение длины при создании поста. Остаётся текстовый контент. Его длина никак не ограничивается в момент создания, а так как пользователи могут писать очень длинные тексты, необходимо предусмотреть обрезание текста до приемлемой длины при показе карточки поста на странице популярного.',
            'author' => 'Владик',
            'avatar' => 'userpic.jpg'
        ],
        [
            'id' => 4,
            'title' => 'Наконец, обработал фотки!',
            'type' => 'photo',
            'content' => 'rock-medium.jpg',
            'author' => 'Виктор',
            'avatar' => 'userpic-mark.jpg'
        ],
        [
            'id' => 5,
            'title' => 'Моя мечта',
            'type' => 'photo',
            'content' => 'coast-medium.jpg',
            'author' => 'Лариса',
            'avatar' => 'userpic-larisa-small.jpg'
        ],
        [
            'id' => 6,
            'title' => 'Лучшие курсы',
            'type' => 'link',
            'content' => 'www.htmlacademy.ru',
            'author' => 'Владик',
            'avatar' => 'userpic.jpg'
        ]
    ];
